HungChienSix/Renesas_SourceCode/模块参考资料/1.44寸128x128LCD-ZJY144KV-PG01技术资料/03-程序源码/03-程序源码/02-STM32例程/01-STM32_标准库例程/01-STM32F103C8/HARDWARE/LCD/spi.h
#ifndef _SPI_H_
#define _SPI_H_

#include "stm32f10x.h"

/* 定义管脚端口 */
#define LCD_SCK_GPIO_PORT   GPIOA
#define LCD_SCK_GPIO_PIN    GPIO_Pin_0
#define LCD_SCK_GPIO_CLK    RCC_APB2Periph_GPIOA

#define LCD_MOSI_GPIO_PORT   GPIOA
#define LCD_MOSI_GPIO_PIN    GPIO_Pin_1
#define LCD_MOSI_GPIO_CLK    RCC_APB2Periph_GPIOA

#define LCD_RES_GPIO_PORT   GPIOA
#define LCD_RES_GPIO_PIN    GPIO_Pin_2
#define LCD_RES_GPIO_CLK    RCC_APB2Periph_GPIOA

#define LCD_DC_GPIO_PORT    GPIOA
#define LCD_DC_GPIO_PIN     GPIO_Pin_3
#define LCD_DC_GPIO_CLK     RCC_APB2Periph_GPIOA

#define LCD_CS_GPIO_PORT    GPIOA
#define LCD_CS_GPIO_PIN     GPIO_Pin_4
#define LCD_CS_GPIO_CLK     RCC_APB2Periph_GPIOA

#define LCD_BLK_GPIO_PORT    GPIOA
#define LCD_BLK_GPIO_PIN     GPIO_Pin_5
#define LCD_BLK_GPIO_CLK     RCC_APB2Periph_GPIOA

/* 定义端口电平状态 */
#define LCD_SCK_Clr() GPIO_ResetBits(LCD_SCK_GPIO_PORT,LCD_SCK_GPIO_PIN)
#define LCD_SCK_Set() GPIO_SetBits(LCD_SCK_GPIO_PORT,LCD_SCK_GPIO_PIN)

#define LCD_MOSI_Clr() GPIO_ResetBits(LCD_MOSI_GPIO_PORT,LCD_MOSI_GPIO_PIN)
#define LCD_MOSI_Set() GPIO_SetBits(LCD_MOSI_GPIO_PORT,LCD_MOSI_GPIO_PIN)

#define LCD_RES_Clr() GPIO_ResetBits(LCD_RES_GPIO_PORT,LCD_RES_GPIO_PIN)
#define LCD_RES_Set() GPIO_SetBits(LCD_RES_GPIO_PORT,LCD_RES_GPIO_PIN)

#define LCD_DC_Clr() GPIO_ResetBits(LCD_DC_GPIO_PORT,LCD_DC_GPIO_PIN)
#define LCD_DC_Set() GPIO_SetBits(LCD_DC_GPIO_PORT,LCD_DC_GPIO_PIN)

#define LCD_CS_Clr() GPIO_ResetBits(LCD_CS_GPIO_PORT,LCD_CS_GPIO_PIN)
#define LCD_CS_Set() GPIO_SetBits(LCD_CS_GPIO_PORT,LCD_CS_GPIO_PIN)

#define LCD_BLK_Clr() GPIO_ResetBits(LCD_BLK_GPIO_PORT,LCD_BLK_GPIO_PIN)
#define LCD_BLK_Set() GPIO_SetBits(LCD_BLK_GPIO_PORT,LCD_BLK_GPIO_PIN)

/* 函数声明 */
void LCD_GPIOInit(void);
void LCD_WR_Bus(uint8_t dat);
void LCD_WR_REG(uint8_t reg);
void LCD_WR_DATA8(uint8_t dat);
void LCD_WR_DATA(uint16_t dat);

#endif



